# LOC AND ILOC

In [3]:
import pandas as pd
data=pd.read_csv(r"C:\Users\ADMIN\Documents\student_data.csv")
data

,id,name,age,grade,math_score,english_score,science_score,attendance_percentage,study_hours,extracurricular
0,1,John Smith,15,10,85,78,82,95.5,5,Yes
1,2,Emma Johnson,16,11,90,85,88,92.3,6,No
2,3,Michael Brown,14,9,75,70,72,88.7,4,Yes
3,4,Sophia Davis,15,10,82,80,79,93.1,5,No
4,5,James Wilson,16,11,88,86,90,96.2,7,Yes
...,...,...,...,...,...,...,...,...,...,...
95,96,Piper Ellis,14,9,74,72,71,88.0,3,No
96,97,Kayden Boyd,15,10,81,79,78,92.9,5,Yes
97,98,Aliyah Holmes,16,11,89,87,86,96.0,8,No
98,99,Declan Porter,14,9,73,71,70,87.8,4,Yes
99,100,Sienna Riley,15,10,82,80,79,93.1,6,No

In [102]:
# 1. Using loc, select all columns for the student with id 10.
print(data.loc[10,"id":"extracurricular"])

id                               11
name                     Noah White
age                              16
grade                            11
math_score                       89
english_score                    87
science_score                    86
attendance_percentage          95.1
study_hours                       7
extracurricular                 Yes
Name: 10, dtype: object

In [3]:
# 2. Using iloc, select the first 5 rows and the first 3 columns of the dataset.
print(data.iloc[0:5,0:2])

   id           name
0   1     John Smith
1   2   Emma Johnson
2   3  Michael Brown
3   4   Sophia Davis
4   5   James Wilson

In [13]:
# 3. Using loc, select the 'name' and 'math_score' for students in grade 11.
print(data.loc[data["grade"]==11,["name","math_score"]])

                name  math_score
1       Emma Johnson          90
4       James Wilson          88
7       Ava Anderson          91
10        Noah White          89
13   Charlotte Lewis          92
16      Daniel Allen          87
19      Evelyn Scott          90
22        Jack Baker          88
25      Avery Carter          89
28    Elijah Roberts          90
31    Grace Campbell          91
34     Aiden Edwards          89
37       Zoey Morris          90
40     Joseph Morgan          88
43       Aria Cooper          89
46          Luke Cox          90
49      Natalie Wood          91
52       Julian Gray          89
55     Lillian Perry          90
58       Jaxon Kelly          88
61     Arianna Price          89
64       Joshua Ross          90
67      Skylar Ortiz          91
70  Tristan Sullivan          89
73       Maya Hunter          90
76      Aaron Bryant          88
79   Eleanor Russell          89
82     Easton Jordan          90
85   Addison Simmons          91
88        Evan Berry          89
91     Brooklyn Dunn          90
94     Caleb Gardner          88
97     Aliyah Holmes          89

In [19]:
#4. Using iloc, select the last 10 rows and columns 2 through 5.
print(data.iloc[-10:,2:5])

    age  grade  math_score
90   15     10          82
91   16     11          90
92   14      9          75
93   15     10          80
94   16     11          88
95   14      9          74
96   15     10          81
97   16     11          89
98   14      9          73
99   15     10          82

In [27]:
#5. Using loc, select all columns for students with attendance_percentage greater than 95.
print(data.loc[data["attendance_percentage"]>95])

    id              name  age  grade  math_score  english_score  \
0    1        John Smith   15     10          85             78
4    5      James Wilson   16     11          88             86
7    8      Ava Anderson   16     11          91             89
10  11        Noah White   16     11          89             87
13  14   Charlotte Lewis   16     11          92             90
16  17      Daniel Allen   16     11          87             85
19  20      Evelyn Scott   16     11          90             88
22  23        Jack Baker   16     11          88             86
25  26      Avery Carter   16     11          89             87
28  29    Elijah Roberts   16     11          90             88
31  32    Grace Campbell   16     11          91             89
34  35     Aiden Edwards   16     11          89             87
37  38       Zoey Morris   16     11          90             88
40  41     Joseph Morgan   16     11          88             86
43  44       Aria Cooper   16     11          89             87
46  47          Luke Cox   16     11          90             88
49  50      Natalie Wood   16     11          91             89
52  53       Julian Gray   16     11          89             87
55  56     Lillian Perry   16     11          90             88
58  59       Jaxon Kelly   16     11          88             86
61  62     Arianna Price   16     11          89             87
64  65       Joshua Ross   16     11          90             88
67  68      Skylar Ortiz   16     11          91             89
70  71  Tristan Sullivan   16     11          89             87
73  74       Maya Hunter   16     11          90             88
76  77      Aaron Bryant   16     11          88             86
79  80   Eleanor Russell   16     11          89             87
82  83     Easton Jordan   16     11          90             88
85  86   Addison Simmons   16     11          91             89
88  89        Evan Berry   16     11          89             87
91  92     Brooklyn Dunn   16     11          90             88
94  95     Caleb Gardner   16     11          88             86
97  98     Aliyah Holmes   16     11          89             87

    science_score  attendance_percentage  study_hours extracurricular
0              82                   95.5            5             Yes
4              90                   96.2            7             Yes
7              87                   97.0            8              No
10             86                   95.1            7             Yes
13             89                   96.5            8              No
16             84                   95.8            7             Yes
19             87                   96.3            8              No
22             85                   95.7            7             Yes
25             86                   96.1            8              No
28             87                   95.9            7             Yes
31             88                   96.4            8              No
34             86                   95.6            7             Yes
37             87                   96.2            8              No
40             85                   95.8            7             Yes
43             86                   96.0            8              No
46             87                   95.9            7             Yes
49             88                   96.3            8              No
52             86                   95.7            7             Yes
55             87                   96.1            8              No
58             85                   95.6            7             Yes
61             86                   96.0            8              No
64             87                   95.8            7             Yes
67             88                   96.2            8              No
70             86                   95.9            7             Yes
73             87                   96.1            8              No
76             85                   95.7            7             Yes
79             86                   96.0            8              No
82             87                   95.8            7             Yes
85             88                   96.2            8              No
88             86                   95.9            7             Yes
91             87                   96.1            8              No
94             85                   95.7            7             Yes
97             86                   96.0            8              No

In [49]:
#6. Using iloc, select every other row from the first 20 rows and columns 0, 3, and 6.

print(data.iloc[0:20,[0,3,6]])

    id  grade  science_score
0    1     10             82
1    2     11             88
2    3      9             72
3    4     10             79
4    5     11             90
5    6      9             65
6    7     10             80
7    8     11             87
8    9      9             71
9   10     10             83
10  11     11             86
11  12      9             67
12  13     10             77
13  14     11             89
14  15      9             70
15  16     10             78
16  17     11             84
17  18      9             69
18  19     10             76
19  20     11             87

In [59]:
#  7. Using loc, select 'name', 'age', and 'science_score' for students named 'Emma Johnson' or 'Liam Martinez'.
print(data.loc[data["name"].isin(['Emma Johnson','Liam Martinez']),["name","age","science_score"]])

            name  age  science_score
1   Emma Johnson   16             88
8  Liam Martinez   14             71

In [68]:
# 8. Using iloc, select the 10th to 15th rows (inclusive) and the last 3 columns.
print(data.iloc[9:15,[7,9]])

    attendance_percentage extracurricular
9                    92.9              No
10                   95.1             Yes
11                   86.8              No
12                   93.4             Yes
13                   96.5              No
14                   88.2             Yes

In [76]:
# 9. Using loc, select all columns for students who participate in extracurricular activities (extracurricular = 'Yes').["
print(data.loc[data["extracurricular"]=="yes"])

Empty DataFrame
Columns: [id, name, age, grade, math_score, english_score, science_score, attendance_percentage, study_hours, extracurricular]
Index: []

In [86]:
# 10. Using iloc, select the first 3 columns for rows 20 to 30.
print(data.iloc[20:30, 0:3])

    id             name  age
20  21      Lucas Green   14
21  22    Abigail Adams   15
22  23       Jack Baker   16
23  24   Emily Gonzalez   14
24  25  Benjamin Nelson   15
25  26     Avery Carter   16
26  27   Mason Mitchell   14
27  28      Sofia Perez   15
28  29   Elijah Roberts   16
29  30     Chloe Turner   14

In [88]:
#      OR
# 10. Using iloc, select the first 3 columns for rows 20 to 30.
print(data.iloc[20:30, [0,1,2]])

    id             name  age
20  21      Lucas Green   14
21  22    Abigail Adams   15
22  23       Jack Baker   16
23  24   Emily Gonzalez   14
24  25  Benjamin Nelson   15
25  26     Avery Carter   16
26  27   Mason Mitchell   14
27  28      Sofia Perez   15
28  29   Elijah Roberts   16
29  30     Chloe Turner   14

In [105]:
#  11. Using loc, select 'name' and 'english_score' for students with math_score above 85.
print(data.loc[data["math_score"]>85,["name","english_score"]])

                name  english_score
1       Emma Johnson             85
4       James Wilson             86
7       Ava Anderson             89
10        Noah White             87
13   Charlotte Lewis             90
16      Daniel Allen             85
19      Evelyn Scott             88
22        Jack Baker             86
25      Avery Carter             87
28    Elijah Roberts             88
31    Grace Campbell             89
34     Aiden Edwards             87
37       Zoey Morris             88
40     Joseph Morgan             86
43       Aria Cooper             87
46          Luke Cox             88
49      Natalie Wood             89
52       Julian Gray             87
55     Lillian Perry             88
58       Jaxon Kelly             86
61     Arianna Price             87
64       Joshua Ross             88
67      Skylar Ortiz             89
70  Tristan Sullivan             87
73       Maya Hunter             88
76      Aaron Bryant             86
79   Eleanor Russell             87
82     Easton Jordan             88
85   Addison Simmons             89
88        Evan Berry             87
91     Brooklyn Dunn             88
94     Caleb Gardner             86
97     Aliyah Holmes             87

In [113]:
# 12. Using iloc, select rows 50 to 60 and columns 'name', 'grade', and 'study_hours' by their index positions.
print(data.iloc[50:61,[1,3,8]])

              name  grade  study_hours
50  Gabriel Fisher      9            4
51  Victoria Stone     10            6
52     Julian Gray     11            7
53    Hazel Hughes      9            3
54       Levi West     10            5
55   Lillian Perry     11            8
56    Grayson Ford      9            4
57    Aubrey Myers     10            6
58     Jaxon Kelly     11            7
59      Ellie Long      9            3
60  Lincoln Foster     10            5

In [129]:
# 13. Using loc, select all columns for students aged 14 who have a science_score below 70.
print(data.loc[(data["age"]==14) & (data["science_score"]<70),data.columns[:9]])

    id           name  age  grade  math_score  english_score  science_score  \
5    6  Olivia Taylor   14      9          70             68             65
11  12     Mia Harris   14      9          71             69             67
17  18   Harper Young   14      9          73             71             69
20  21    Lucas Green   14      9          72             70             68

    attendance_percentage  study_hours
5                    87.4            3
11                   86.8            3
17                   87.9            3
20                   88.5            4

In [134]:
#  14. Using iloc, select the 5th column for the first 25 rows.
print(data.iloc[1:26,0:5])

    id              name  age  grade  math_score
1    2      Emma Johnson   16     11          90
2    3     Michael Brown   14      9          75
3    4      Sophia Davis   15     10          82
4    5      James Wilson   16     11          88
5    6     Olivia Taylor   14      9          70
6    7     William Moore   15     10          83
7    8      Ava Anderson   16     11          91
8    9     Liam Martinez   14      9          76
9   10   Isabella Thomas   15     10          84
10  11        Noah White   16     11          89
11  12        Mia Harris   14      9          71
12  13       Ethan Clark   15     10          80
13  14   Charlotte Lewis   16     11          92
14  15  Alexander Walker   14      9          74
15  16       Amelia Hall   15     10          81
16  17      Daniel Allen   16     11          87
17  18      Harper Young   14      9          73
18  19        Henry King   15     10          79
19  20      Evelyn Scott   16     11          90
20  21       Lucas Green   14      9          72
21  22     Abigail Adams   15     10          80
22  23        Jack Baker   16     11          88
23  24    Emily Gonzalez   14      9          74
24  25   Benjamin Nelson   15     10          81
25  26      Avery Carter   16     11          89

In [136]:
#   15. Using loc, select 'name', 'math_score', and 'english_score' for students with study_hours equal to 8.
print(data.loc[data["study_hours"]==8,["name","math_score","english_score"]])

               name  math_score  english_score
7      Ava Anderson          91             89
13  Charlotte Lewis          92             90
19     Evelyn Scott          90             88
25     Avery Carter          89             87
31   Grace Campbell          91             89
37      Zoey Morris          90             88
43      Aria Cooper          89             87
49     Natalie Wood          91             89
55    Lillian Perry          90             88
61    Arianna Price          89             87
67     Skylar Ortiz          91             89
73      Maya Hunter          90             88
79  Eleanor Russell          89             87
85  Addison Simmons          91             89
91    Brooklyn Dunn          90             88
97    Aliyah Holmes          89             87

In [5]:
#  16. Using iloc, select rows 0, 10, 20, 30, and 40 and columns 1, 4, and 7.
print(data.iloc[[0, 10, 20, 30,40],[1,4,7]])

              name  math_score  attendance_percentage
0       John Smith          85                   95.5
10      Noah White          89                   95.1
20     Lucas Green          72                   88.5
30  Jacob Phillips          80                   93.3
40   Joseph Morgan          88                   95.8

In [17]:
#  17. Using loc, select all columns for students whose names start with 'A'.
print(data.loc[data['name'].str.startswith('B')])

    id             name  age  grade  math_score  english_score  science_score  \
24  25  Benjamin Nelson   15     10          81             79             78
91  92    Brooklyn Dunn   16     11          90             88             87

    attendance_percentage  study_hours extracurricular
24                   93.2            5             Yes
91                   96.1            8              No

In [24]:
#  18. Using iloc, select the last 5 rows and the first 4 columns.
print(data.iloc[-5:,:5])

     id           name  age  grade  math_score
95   96    Piper Ellis   14      9          74
96   97    Kayden Boyd   15     10          81
97   98  Aliyah Holmes   16     11          89
98   99  Declan Porter   14      9          73
99  100   Sienna Riley   15     10          82

In [33]:
#  19. Using loc, select 'name' and 'attendance_percentage' for students with math_score and science_score both above 80.
print(data.loc[(data["math_score"] > 80) & (data["science_score"] > 80), ["name", "attendance_percentage"]])

                name  attendance_percentage
0         John Smith                   95.5
1       Emma Johnson                   92.3
4       James Wilson                   96.2
7       Ava Anderson                   97.0
9    Isabella Thomas                   92.9
10        Noah White                   95.1
13   Charlotte Lewis                   96.5
16      Daniel Allen                   95.8
19      Evelyn Scott                   96.3
22        Jack Baker                   95.7
25      Avery Carter                   96.1
28    Elijah Roberts                   95.9
31    Grace Campbell                   96.4
34     Aiden Edwards                   95.6
37       Zoey Morris                   96.2
40     Joseph Morgan                   95.8
43       Aria Cooper                   96.0
46          Luke Cox                   95.9
49      Natalie Wood                   96.3
52       Julian Gray                   95.7
55     Lillian Perry                   96.1
58       Jaxon Kelly                   95.6
61     Arianna Price                   96.0
64       Joshua Ross                   95.8
67      Skylar Ortiz                   96.2
70  Tristan Sullivan                   95.9
73       Maya Hunter                   96.1
76      Aaron Bryant                   95.7
79   Eleanor Russell                   96.0
82     Easton Jordan                   95.8
85   Addison Simmons                   96.2
88        Evan Berry                   95.9
91     Brooklyn Dunn                   96.1
94     Caleb Gardner                   95.7
97     Aliyah Holmes                   96.0

In [35]:
#  20. Using iloc, select every 5th row from 0 to 50 and columns 2, 5, and 8.
print(data.iloc[0:50:5,[2,5,8]])

    age  english_score  study_hours
0    15             78            5
5    14             68            3
10   16             87            7
15   15             79            6
20   14             70            4
25   16             87            8
30   15             78            5
35   14             71            3
40   16             86            7
45   15             80            6

In [56]:
#  21. Using loc, select 'name', 'grade', and 'extracurricular' for students with english_score between 75 and 85 (inclusive).
print(data.loc[(data["english_score"] >= 75) & (data["english_score"] <= 85), ["name", "grade", "extracurricular"]])

                  name  grade extracurricular
0           John Smith     10             Yes
1         Emma Johnson     11              No
3         Sophia Davis     10              No
6        William Moore     10             Yes
9      Isabella Thomas     10              No
12         Ethan Clark     10             Yes
15         Amelia Hall     10              No
16        Daniel Allen     11             Yes
18          Henry King     10             Yes
21       Abigail Adams     10              No
24     Benjamin Nelson     10             Yes
27         Sofia Perez     10              No
30      Jacob Phillips     10             Yes
33       Madison Evans     10              No
36      Samuel Stewart     10             Yes
39       Penelope Cook     10              No
42       Carter Brooks     10             Yes
45       Hannah Rivera     10              No
48        Isaac Butler     10             Yes
51      Victoria Stone     10              No
54           Levi West     10             Yes
57        Aubrey Myers     10              No
60      Lincoln Foster     10             Yes
63    Savannah Sanders     10              No
66  Christian Marshall     10             Yes
69         Clara Wells     10              No
72       Eli Henderson     10             Yes
75         Nora Hudson     10              No
78       Isaiah Barnes     10             Yes
81       Aria Peterson     10              No
84           Ezra Reid     10             Yes
87      Paisley Pierce     10              No
90         Nathan Hart     10             Yes
93          Audrey Fox     10              No
96         Kayden Boyd     10             Yes
99        Sienna Riley     10              No

In [59]:
#  22. Using iloc, select rows 70 to 80 and the columns corresponding to 'age', 'math_score', and 'science_score'.
print(data.iloc[70:81,[0,4,6]])

    id  math_score  science_score
70  71          89             86
71  72          73             70
72  73          82             79
73  74          90             87
74  75          75             72
75  76          80             77
76  77          88             85
77  78          74             71
78  79          81             78
79  80          89             86
80  81          73             70

In [63]:
#  23. Using loc, select all columns for students in grade 9 with study_hours less than 4.
print(data.loc[(data["grade"] == 9) & (data["study_hours"] < 4)])

    id            name  age  grade  math_score  english_score  science_score  \
5    6   Olivia Taylor   14      9          70             68             65
11  12      Mia Harris   14      9          71             69             67
17  18    Harper Young   14      9          73             71             69
23  24  Emily Gonzalez   14      9          74             72             71
29  30    Chloe Turner   14      9          75             73             72
35  36   Layla Collins   14      9          73             71             70
41  42      Riley Bell   14      9          74             72             71
47  48     Stella Ward   14      9          75             73             72
53  54    Hazel Hughes   14      9          73             71             70
59  60      Ellie Long   14      9          74             72             71
65  66  Aurora Jenkins   14      9          75             73             72
71  72   Delilah Hayes   14      9          73             71             70
77  78      Lydia Cole   14      9          74             72             71
83  84     Lila Murray   14      9          75             73             72
89  90     Autumn Ford   14      9          73             71             70
95  96     Piper Ellis   14      9          74             72             71

    attendance_percentage  study_hours extracurricular
5                    87.4            3              No
11                   86.8            3              No
17                   87.9            3              No
23                   87.6            3              No
29                   87.7            3              No
35                   87.8            3              No
41                   87.9            3              No
47                   88.0            3              No
53                   88.1            3              No
59                   88.0            3              No
65                   88.2            3              No
71                   88.0            3              No
77                   88.1            3              No
83                   88.0            3              No
89                   88.1            3              No
95                   88.0            3              No

In [72]:
#  24. Using iloc, select the first 10 rows and the last 2 columns.
print(data.iloc[0:10,-2:])

   study_hours extracurricular
0            5             Yes
1            6              No
2            4             Yes
3            5              No
4            7             Yes
5            3              No
6            6             Yes
7            8              No
8            4             Yes
9            5              No

In [75]:
#  25. Using loc, select 'name', 'age', and 'attendance_percentage' for students with id in the range 50 to 75.
print(data.loc[(data["id"]>=50)&(data["id"]<=75),["name","age","attendance_percentage"]])

                  name  age  attendance_percentage
49        Natalie Wood   16                   96.3
50      Gabriel Fisher   14                   87.8
51      Victoria Stone   15                   92.6
52         Julian Gray   16                   95.7
53        Hazel Hughes   14                   88.1
54           Levi West   15                   93.0
55       Lillian Perry   16                   96.1
56        Grayson Ford   14                   87.9
57        Aubrey Myers   15                   92.8
58         Jaxon Kelly   16                   95.6
59          Ellie Long   14                   88.0
60      Lincoln Foster   15                   92.9
61       Arianna Price   16                   96.0
62      Connor Griffin   14                   87.7
63    Savannah Sanders   15                   93.1
64         Joshua Ross   16                   95.8
65      Aurora Jenkins   14                   88.2
66  Christian Marshall   15                   92.7
67        Skylar Ortiz   16                   96.2
68     Jeremiah Gordon   14                   87.9
69         Clara Wells   15                   93.0
70    Tristan Sullivan   16                   95.9
71       Delilah Hayes   14                   88.0
72       Eli Henderson   15                   92.8
73         Maya Hunter   16                   96.1
74       Micah Andrews   14                   87.7

# DATA CLEANING

In [75]:
import pandas as pd
df=pd.read_csv(r"C:\Users\ADMIN\Documents\customer_data.csv")
df.head()                                                            # TOP 5

,customer_id,customer_type,region,payment_method,satisfaction_level,subscription_plan,age,annual_income,purchase_amount,account_age_months,num_transactions
0,1,Individual,South,Credit Card,High,Premium,45.0,75000,120.5,24.0,15
1,2,Business,West,NaN,Medium,Basic,NaN,92000,85.3,18.0,22
2,3,Individual,North,Debit Card,Low,Standard,32.0,45000,50.7,12.0,8
3,4,NaN,East,Credit Card,High,Premium,28.0,68000,200.1,36.0,30
4,5,Business,South,PayPal,Medium,NaN,55.0,110000,NaN,15.0,25

In [57]:
df.isnull().sum()

customer_id            0
customer_type         99
region                 0
payment_method        90
satisfaction_level    13
subscription_plan     37
age                   10
annual_income          0
purchase_amount       40
account_age_months     1
num_transactions       0
dtype: int64

In [58]:
df['customer_type'] = df['customer_type'].fillna('python')
df['customer_type'].isnull().sum()

np.int64(0)

In [61]:
df['age'] = df['age'].fillna(df['age'].mean())
df['age'].isnull().sum()                         # MEAN AND MEDIAN WE WILL USE FOR NUMERICAL COLUMN

np.int64(0)

In [62]:
df['purchase_amount'] = df['purchase_amount'].fillna(df['purchase_amount'].median())
df['purchase_amount'].isnull().sum()

np.int64(0)

In [63]:
df['satisfaction_level'] = df['satisfaction_level'].fillna(df['satisfaction_level'].mode()[0])
df['satisfaction_level'].isnull().sum()

np.int64(0)

In [64]:
df['subscription_plan'] = df['subscription_plan'].fillna(df['subscription_plan'].mode()[0])
df['subscription_plan'].isnull().sum()

np.int64(0)

In [65]:
df['account_age_months'] = df['account_age_months'].fillna(df['account_age_months'].mean())
df['account_age_months'].isnull().sum()

np.int64(0)

In [66]:
df['payment_method'] = df['payment_method'].fillna(df['payment_method'].mode()[0])
df['payment_method'].isnull().sum()

np.int64(0)

In [69]:
df.isnull().sum()

customer_id           0
customer_type         0
region                0
payment_method        0
satisfaction_level    0
subscription_plan     0
age                   0
annual_income         0
purchase_amount       0
account_age_months    0
num_transactions      0
dtype: int64

In [70]:
df

,customer_id,customer_type,region,payment_method,satisfaction_level,subscription_plan,age,annual_income,purchase_amount,account_age_months,num_transactions
0,1,Individual,South,Credit Card,High,Premium,45.00000,75000,120.5,24.0,15
1,2,Business,West,Credit Card,Medium,Basic,39.32069,92000,85.3,18.0,22
2,3,Individual,North,Debit Card,Low,Standard,32.00000,45000,50.7,12.0,8
3,4,python,East,Credit Card,High,Premium,28.00000,68000,200.1,36.0,30
4,5,Business,South,PayPal,Medium,Premium,55.00000,110000,130.4,15.0,25
...,...,...,...,...,...,...,...,...,...,...,...
295,296,Business,East,Credit Card,High,Premium,41.00000,82000,130.4,19.0,15
296,297,Individual,South,Credit Card,Medium,Standard,33.00000,64000,100.4,15.0,11
297,298,python,West,Debit Card,Low,Basic,50.00000,104000,170.6,28.0,22
298,299,Business,North,Credit Card,High,Premium,36.00000,71000,110.3,20.0,14
299,300,Individual,East,Credit Card,Medium,Premium,29.00000,52000,80.5,12.0,10

# JOIN AND MERGE QUESTIONS

In [7]:
import pandas as pd
df=pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
df.head()

  Student_ID          Name  Age        Department
0       S001    John Smith   20  Computer Science
1       S002  Emma Johnson   19       Mathematics
2       S003  Michael Chen   21           Physics
3       S004  Sophia Patel   20         Chemistry
4       S005     James Lee   22           Biology

In [2]:
# 1. Load `students.csv` into a pandas DataFrame and display the first 3 rows.
df.head(3)

  Student_ID          Name  Age        Department
0       S001    John Smith   20  Computer Science
1       S002  Emma Johnson   19       Mathematics
2       S003  Michael Chen   21           Physics

In [3]:
# 2. Load `courses.csv` into a pandas DataFrame and display the last 3 rows.
df.tail(3)

   Student_ID             Name  Age Department
47       S048    Andrew Murphy   20    Physics
48       S049  Samantha Rivera   22  Chemistry
49       S050     Dylan Cooper   19    Biology

In [9]:
# 3. Concatenate the first 10 rows of `students.csv` with itself vertically. How many rows are in the result?
df = pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
result = pd.concat([df.head(10), df.head(10)], axis=0)
print(len(result))

20

In [14]:
# 4. Concatenate the first 5 rows of `students.csv` and `courses.csv` horizontally. What is the shape of the result?
df = pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
result = pd.concat([df.head(5), df.head(5)], axis=1)
print(len(result))

5

In [17]:
# 5. Merge `students.csv` and `courses.csv` using `Student_ID` with an inner merge. Show the first 3 rows.
import pandas as pd
students = pd.read_csv(r"C:\Users\ADMIN\Documents\students.csv")
courses = pd.read_csv(r"C:\Users\ADMIN\Documents\courses.csv")
c = pd.merge(students, courses, on='Student_ID', how='inner')
print(c.head(3))

  Student_ID          Name  Age        Department Course_ID  \
0       S001    John Smith   20  Computer Science      C101
1       S001    John Smith   20  Computer Science      C106
2       S002  Emma Johnson   19       Mathematics      C102

                Course_Name Grade
0  Programming Fundamentals     A
1            Linear Algebra     B
2                Calculus I     B